Revit 2027 API
ColorOptions.CalculatingColor Property
 The color of the current canvas theme used to render elements when some aspect of their properties is currently being recalculated.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public Color CalculatingColor { get; set; }
Public Property CalculatingColor As Color
	Get
	Set
public:
property Color^ CalculatingColor {
	Color^ get ();
	void set (Color^ value);
}
member CalculatingColor : Color with get, set
Property Value
Color
Exceptions
Exception | Condition
ArgumentNullException |  When setting this property: A non-optional argument was null
See Also
Reference
ColorOptions Class
Autodesk.Revit.DB Namespace